/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strstr(main).c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ihahn <ihahn@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/18 18:28:46 by ihahn             #+#    #+#             */
/*   Updated: 2019/01/18 18:33:13 by ihahn            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>  
#include <string.h>
int main (void)
{    
   char str1 [11] = "0123456789"; // Массив со строкой для поиска
   char str2 [10] = "345"; // Набор символов, которые должны входить в искомый сегмент
   char *istr1; // Переменная, в которую будет занесен адрес первой найденной строки

   istr1 = strstr (str1,str2); //Поиск строки

   if ( istr1 == NULL)
      printf ("Строка не найдена\n"); //Вывод результата поиска на консоль
   else
      printf ("Искомая строка начинается с символа %d\n",istr1 - str1 + 1);
   return 0;
}